In [1]:
import mysql.connector as mydb

In [2]:
conn = mydb.connect(host = "localhost",user = "root",password="")

In [11]:
conn = mydb.connect(host = "localhost",user="root",password="")
cursor = conn.cursor()
cursor.execute(
    """SHOW DATABASES"""
)
for i in cursor:
    print(i)

('college',)
('information_schema',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('school',)
('test',)
('university',)

In [10]:
conn = mydb.connect(host = "localhost", user="root",password="")
cursor = conn.cursor()
cursor.execute(
    """CREATE DATABASE school"""
)
conn.commit()

In [12]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """CREATE TABLE student(roll int PRIMARY KEY,name varchar(15),age int,city varchar(15))"""
)
conn.commit()

In [14]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SHOW TABLES"""
)
for i in cursor:
    print(i)

('student',)

In [16]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """INSERT INTO student(roll,name,age,city) VALUES(%s,%s,%s,%s)""",(101,"Raihan",25,"Dhaka")
)
conn.commit()

In [19]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student"""
)
for i in cursor:
    print(i)

(101, 'Raihan', 25, 'Dhaka')

In [22]:
user = [
    (102,'Jhone smith',27,"khulna"),
    (103, "Alexa Jones", 23, "Chittagong"),
    (104, "Alley P", 26,"Feni"),
    (105, "John S", 27,"Dhaka"),
    (106, "Babar Azam", 30,"Faridpur" ),
    (107, "Afridi", 29,"Gajipur"),
    (108, "Nasir", 24,"Dhaka"),
]

conn = mydb.connect(host = "localhost",user = "root",password="",database="school")
cursor = conn.cursor()
cursor.executemany(
    """INSERT INTO student(roll,name,age,city) VALUES(%s,%s,%s,%s)""",user
)
conn.commit()

In [27]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student"""
)
for i in cursor:
    print(i)

(101, 'Raihan', 25, 'Dhaka')
(102, 'Jhone smith', 27, 'khulna')
(103, 'Alexa Jones', 23, 'Chittagong')
(104, 'Alley P', 26, 'Feni')
(106, 'Babar Azam', 30, 'Faridpur')
(107, 'Afridi', 29, 'Gajipur')
(108, 'Nasir', 24, 'Dhaka')
(115, 'AL Mamun', 25, 'London')

In [26]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """UPDATE student SET roll = %s,name=%s,age=%s,city=%s WHERE roll=%s """, (115,'AL Mamun',25,"London",105)

)
conn.commit()

In [30]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """DELETE FROM student WHERE roll = %s """,(115,)

)
conn.commit()

In [32]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM STUDENT WHERE age>%s """,(24,)

)
for i in cursor:
    print(i)

(101, 'Raihan', 25, 'Dhaka')
(102, 'Jhone smith', 27, 'khulna')
(104, 'Alley P', 26, 'Feni')
(106, 'Babar Azam', 30, 'Faridpur')
(107, 'Afridi', 29, 'Gajipur')

In [34]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM STUDENT WHERE age>%s AND city=%s """,(24,"Dhaka")

)
for i in cursor:
    print(i)

(101, 'Raihan', 25, 'Dhaka')

In [36]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM STUDENT WHERE name LIKE '%h' """

)
for i in cursor:
    print(i)

(102, 'Jhone smith', 27, 'khulna')

In [38]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SELECT MAX(age),MIN(age),AVG(age),SUM(age) FROM student """

)
for i in cursor:
    print(i)

(30, 23, Decimal('26.2857'), Decimal('184'))

In [41]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SELECT COUNT(*),age FROM student GROUP BY age """

)
for i in cursor:
    print(i)

(1, 23)
(1, 24)
(1, 25)
(1, 26)
(1, 27)
(1, 29)
(1, 30)

In [44]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """CREATE TABLE result_details(roll int,dept varchar(10),cgpa float) """

)
conn.commit()

In [46]:
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.execute(
    """SHOW TABLES"""

)
for i in cursor:
    print(i)

('result',)
('result_details',)
('student',)

In [49]:
user = [
    (101,'CSE',3.80),
    (102,'CSE',3.85),
    (103,'ENG',3.92),
    (104,'EEE',3.75),
    (106,'EEE',3.65),
    (107,'MATH',3.90)
]
conn = mydb.connect(host = "localhost",user = "root",password = "",database= "school") 
cursor = conn.cursor()
cursor.executemany(
    """INSERT INTO result(roll,dept,cgpa) VALUES(%s,%s,%s)""",user

)
conn.commit()

In [57]:
conn = mydb.connect(host="localhost",user="root",password="",database = "school")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM result"""
)
for i in cursor:
    print(i)

(101, 'CSE', 3.8)
(102, 'CSE', 3.85)
(103, 'ENG', 3.92)
(104, 'EEE', 3.75)
(106, 'EEE', 3.65)
(107, 'MATH', 3.9)

In [58]:
conn = mydb.connect(host="localhost",user="root",password="",database = "school")
cursor = conn.cursor()
cursor.execute(
    """SELECT student.roll,name,dept,cgpa
        from student,result
        where student.roll = result.roll"""
)
for i in cursor:
    print(i)

(101, 'Raihan', 'CSE', 3.8)
(102, 'Jhone smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

In [59]:
conn = mydb.connect(host="localhost",user="root",password="",database = "school")
cursor = conn.cursor()
cursor.execute(
    """SELECT std.roll,std.name,r.dept,r.cgpa
        from student AS std Join result AS r
        ON std.roll = r.roll"""
)
for i in cursor:
    print(i)

(101, 'Raihan', 'CSE', 3.8)
(102, 'Jhone smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

In [60]:
conn = mydb.connect(host="localhost",user="root",password="",database = "school")
cursor = conn.cursor()
cursor.execute(
    """SELECT std.roll,std.name,r.dept,r.cgpa
        from student AS std INNER Join result AS r
        ON std.roll = r.roll"""
)
for i in cursor:
    print(i)

(101, 'Raihan', 'CSE', 3.8)
(102, 'Jhone smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

In [61]:
conn = mydb.connect(host="localhost",user="root",password="",database = "school")
cursor = conn.cursor()
cursor.execute(
    """CREATE VIEW student_view AS
       SELECT std.roll,std.name,r.dept,r.cgpa 
       from student AS std INNER Join result AS r
       ON std.roll = r.roll"""
)
conn.commit()

In [66]:
conn = mydb.connect(host="localhost",user="root",password="",database = "school")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student_view"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'Jhone smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

In [65]:
conn = mydb.connect(host="localhost",user="root",password="",database = "school")
cursor = conn.cursor()
cursor.execute(
    """UPDATE student_view
       SET name = "Raihan Sikdar"
       WHERE roll = 101"""
)
conn.commit()

In [68]:
conn = mydb.connect(host="localhost",user="root",password="",database = "school")
cursor = conn.cursor()
cursor.execute(
    """INSERT INTO student_view(roll,name,dept,cgpa) VALUES(%s,%s,%s,%s)""",(120,"Disha","ENG",3.70)
)
conn.commit()

DatabaseError: 1393 (HY000): Can not modify more than one base table through a join view 'school.student_view'